const Discord = require('discord.js');
const client = new Discord.Client();
const fs = require('fs')
const Jimp = require('jimp');
const talkedRecently = new Set();
const config = require("./config.json");

const MongoClient = require('mongodb').MongoClient;
const url2 = config.url2;
const url = config.url
const dbName = config.dbName
//let r = await awaitmongo(url, dbName, 'find', 'xp', {name: member.id})
const awaitmongo = require('awaitmongodb')

module.exports.run = async (client, message, args, talkedRecently, talkedRecently2) =>
{
    if (message.author.id != '190183161425035285') return

    try {
 let em = new Discord.RichEmbed()
     .addField('Главное правило:', 'Не будь ~~какашкой~~')
     .setImage('https://cdn.discordapp.com/attachments/667767852094324736/667791446295707658/source.gif')
     .setColor(16236543)
        message.channel.send(em)
    em = new Discord.RichEmbed()
        .setDescription('1.Недопустимое поведение не разрешается, если вы грубо обращаетесь с персоналом или с участниками сервера, вы получите предупреждение в зависимости от ситуации. Если это не прекратится, это приведет к серьезным последствиям \n' +
            '\n' +
            '2. Никакого спама, рейдерство, деанона, спойлеры или троллинга \n' +
            '\n' +
            '3. Реклама посторонних источников запрещена\n' +
            ' \n' +
            '4. Оскорбительные / неуместные аватары и имена не допускаются. Пожалуйста, держите политику и 18 + флирт и драму в DMs\n' +
            ' \n' +
            '5. Не линкуйте стафф без повода , участников с любой ролью тем более \n' +
            '\n' +
            '6. Будьте почтительны к персоналу \n' +
            'Если вы делаете что-то, что мы не разрешаем, и персонал говорит вам не делать этого и предупреждает вас, даже если это явно не указано здесь, вы все равно нарушаете правила. Если сотрудник токсичен, перейдите к владельцу или другому администратору. Не выдавайте себя за персонал, мы хорошо знаем друг друга, так что даже не пытайтесь\n' +
            ' \n' +
            '7.Не поднимайте темы о религии, политике, гендере и т.д., Потому что это может вызвать споры в чате\n' +
            ' \n' +
            '8.Не доставайте других участников, если они этого не желают\n' +
            ' \n' +
            '9.Не драматизируй. Не ной. Жизнь прекрасна! \n' +
            '\n' +
            '10. Никаких оскорбительных / расовых оскорблений. Это не смешно. Никому не позволено говорить подобное')
        .setColor(16236543)
        message.channel.send(em)

        em = new Discord.RichEmbed()
            .setDescription('Если у тебя имеются вопросы, то тебе может помочь наша команда:\n \n<@&667803973935300619> - старшая администрация;\n<@&667804067912876051> - администрация;\n<@&667804489281044481> - кураторы модераторов;\n<@&667804673369178133> - кураторы ивентеров;\n<@&667804793535987726> - модерация;\n<@&667804941292666920> - персонал на испытательном сроке.\n'
            )
            .setColor(16236543)
        message.channel.send(em)


        em = new Discord.RichEmbed()
            .setDescription("Приветствуем тебя на сервере ☆ Империя Юни ☆\n" +
                "Здесь ты узнаешь много нового и найдёшь себе общение по душе.\n" +
                "\n" +
                "Стой! Стой! Стой!\n" +
                "\n" +
                "Не торопись в гущу событий.\n" +
                "Прежде чем перейти к голосовым и текстовым каналам, ознакомься с этим местом получше, а в этом мы тебе поможем.")
            .setColor(16236543)
        message.channel.send(em)

        em = new Discord.RichEmbed()
            .setDescription("Вот тебе источники дополнительной информации по нашему серверу:\n \n<#667743373859487767> - самые горячие новостные сводки;\n" +
                "<#667743450770178067> - афиша мероприятий;\n" +
                "<#667784412536111108> - звездочки сервера;\n" +
                "<#667784986123829269> - команды управления ботом;\n" +
                "<#668416135200505881> - уведомления о новых видео;")
            .setColor(16236543)
        message.channel.send(em)

    }
    catch (err) {
        console.log(err)
    }
}
module.exports.help = {
    name: 'emb',
    aliases:["emи"]}