const Discord = require('discord.js');
const hook = new Discord.WebhookClient('667795367571619851', '2YjN5fG7aIiduVMMtmsv70Bhg2R5rO9UHGrwpXVX1drKkb6DDAdTik0uQmcs4Xe1bbt0');

const client = new Discord.Client();
const fs = require('fs')
const Jimp = require('jimp');
const talkedRecently = new Set();
const MongoClient = require('mongodb').MongoClient;

//let r = await awaitmongo(url, dbName, 'find', 'xp', {name: member.id})
const awaitmongo = require('awaitmongodb')

module.exports.run = async (client, message, args, talkedRecently, talkedRecently2) =>
{
    if (message.author.id != '190183161425035285') return
const ch = message.channel

    try {
        var da = {
            "embeds": [
                ,
                {
                    "description": " 1.Недопустимое поведение не разрешается, если вы грубо обращаетесь с персоналом или с участниками сервера, вы получите предупреждение в зависимости от ситуации. Если это не прекратится, это приведет к серьезным последствиям \n \n 2. Никакого спама, рейдерство, деанона, спойлеры или троллинга \n \n 3. Реклама посторонних источников запрещена \n \n 4. Оскорбительные / неуместные аватары и имена не допускаются. Пожалуйста, держите политику и 18 + флирт и драму в DMs \n \n 5. Не линкуйте стафф без повода , участников с любой ролью тем более \n \n 6. Будьте почтительны к персоналу \n Если вы делаете что-то, что мы не разрешаем, и персонал говорит вам не делать этого и предупреждает вас, даже если это явно не указано здесь, вы все равно нарушаете правила. Если сотрудник токсичен, перейдите к владельцу или другому администратору. Не выдавайте себя за персонал, мы хорошо знаем друг друга, так что даже не пытайтесь \n \n 7.Не поднимайте темы о религии, политике, гендере и т.д., Потому что это может вызвать споры в чате \n \n 8.Не доставайте других участников, если они этого не желают \n \n 9.Не драматизируй. Не ной. Жизнь прекрасна! \n \n 10. Никаких оскорбительных / расовых оскорблений. Это не смешно. Никому не позволено говорить подобное"
                    , "color": 16757228

                }

            ]

        }

const  d =  new Discord.RichEmbed({


    "description": " 1.Недопустимое поведение не разрешается, если вы грубо обращаетесь с персоналом или с участниками сервера, вы получите предупреждение в зависимости от ситуации. Если это не прекратится, это приведет к серьезным последствиям \n \n 2. Никакого спама, рейдерство, деанона, спойлеры или троллинга \n \n 3. Реклама посторонних источников запрещена  \n \n  4. Оскорбительные / неуместные аватары и имена не допускаются. Пожалуйста, держите политику и 18 + флирт и драму в DMs  \n \n  5. Не линкуйте стафф без повода , участников с любой ролью тем более \n \n  6. Будьте почтительны к персоналу \n Если вы делаете что-то, что мы не разрешаем, и персонал говорит вам не делать этого и предупреждает вас, даже если это явно не указано здесь, вы все равно нарушаете правила. Если сотрудник токсичен, перейдите к владельцу или другому администратору. Не выдавайте себя за персонал, мы хорошо знаем друг друга, так что даже не пытайтесь  \n \n   7.Не поднимайте темы о религии, политике, гендере и т.д., Потому что это может вызвать споры в чате  \n \n   8.Не доставайте других участников, если они этого не желают   \n \n  9.Не драматизируй. Не ной. Жизнь прекрасна! \n \n 10. Никаких оскорбительных / расовых оскорблений. Это не смешно. Никому не позволено говорить подобное"
    , "color": 16757228




})
       const sd = new Discord.RichEmbed({
            "url": "https://discordapp.com",

            "thumbnail": {
                "url": "https://cdn.discordapp.com/attachments/667767852094324736/667791446295707658/source.gif"
            },

            "fields": [
                {
                    "name": "Главное правило:",
                    "value": "Не будь ~~какашкой~~"
                }

            ],
            "color": 16757228

        })
           ch.send(sd)
           ch.send(d)
    }
    catch (err) {
        console.log(err)
    }
}
module.exports.help = {
    name: 'webhook'}
